data-collation/results/control.ab.txt
This is ApacheBench, Version 2.3 <$Revision: 655654 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        gunicorn/0.11.2.ff8890e-git
Server Hostname:        localhost
Server Port:            8000

Document Path:          /control
Document Length:        37 bytes

Concurrency Level:      1
Time taken for tests:   5.820 seconds
Complete requests:      10000
Failed requests:        0
Write errors:           0
Total transferred:      2150000 bytes
HTML transferred:       370000 bytes
Requests per second:    1718.27 [#/sec] (mean)
Time per request:       0.582 [ms] (mean)
Time per request:       0.582 [ms] (mean, across all concurrent requests)
Transfer rate:          360.77 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       1
Processing:     0    1   0.1      0       1
Waiting:        0    0   0.1      0       1
Total:          0    1   0.1      1       1
ERROR: The median and mean for the processing time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      1
  75%      1
  80%      1
  90%      1
  95%      1
  98%      1
  99%      1
 100%      1 (longest request)